Documents/си_ВводНачальныхОстатковМатериаловВЭксплуатации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>си_ВводНачальныхОстатковМатериаловВЭксплуатации</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.си_МатериалыНаСкладе</xr:Item>
				<xr:Item>AccountingRegister.Налоговый</xr:Item>
				<xr:Item>AccountingRegister.Типовой</xr:Item>
				<xr:Item>AccumulationRegister.си_МатериалыВЭксплуатации</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаНУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыУчетаНУ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурноеПодразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчитыватьКПН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтражатьВБухгалтерскомУчете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Состояние</Name>
							<Type>
								<v8:Type>cfg:EnumRef.си_СостоянияМатериалов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОстаточныйСрокСлужбы</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазначениеИспользования</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.си_НазначенияИспользования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеОрганизации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
								<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПередачиВЭксплуатацию</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументПередачи</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.си_ПередачаМатериаловВЭксплуатацию</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.си_ХарактеристикиСпецодеждыИИнвентаря</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/си_ВводНачальныхОстатковМатериаловВЭксплуатации/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Функция формирование печатной формы
//
Функция ПечатьВводНачальныхОстатков1(МассивОбъектов, ОбъектыПечати) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.си_ВводНачальныхОстатковМатериаловВЭксплуатации.ПФ_MXL_ВводНачальныхОстатков");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ВводНачальныхОстатков";
	
	Для каждого ДокументСсылка	 Из МассивОбъектов Цикл
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокВводОстатков.Организация,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатков.Организация) КАК ПечОрганизация,
	|	ДокВводОстатков.СтруктурноеПодразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатков.СтруктурноеПодразделение) КАК ПечПодразделение,
	|	ДокВводОстатков.Ссылка КАК Док,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатков.Ссылка) КАК ПечДок,
	|	ДокВводОстатков.Номер,
	|	ДокВводОстатков.Дата
	|ИЗ
	|	Документ.си_ВводНачальныхОстатковМатериаловВЭксплуатации КАК ДокВводОстатков
	|ГДЕ
	|	ДокВводОстатков.Ссылка = &ТекДок";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр( "ТекДок",   ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Шапка = РезультатЗапроса.Выбрать();
	Шапка.Следующий();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокВводОстатковМатериалы.НомерСтроки КАК НомерСтроки,
	|	ДокВводОстатковМатериалы.ЕдиницаИзмерения КАК ЕдИзм,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатковМатериалы.ЕдиницаИзмерения) КАК ПечЕдИзм,
	|	ДокВводОстатковМатериалы.Номенклатура КАК Материал,
	|	ДокВводОстатковМатериалы.Номенклатура.Код КАК Код,
	|	ДокВводОстатковМатериалы.Номенклатура.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатковМатериалы.Номенклатура) КАК ПечМатериал,
	|	ДокВводОстатковМатериалы.Количество,
	|	ДокВводОстатковМатериалы.Сотрудник КАК Работник,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатковМатериалы.Сотрудник) КАК ПечРаботник,
	|	ДокВводОстатковМатериалы.ДокументПередачи КАК ПечДокПередачи,
	|	ДокВводОстатковМатериалы.ДатаПередачиВЭксплуатацию КАК ДатаПередачи,
	|	ДокВводОстатковМатериалы.Характеристика КАК Характеристика
	|ИЗ
	|	Документ.си_ВводНачальныхОстатковМатериаловВЭксплуатации.Материалы КАК ДокВводОстатковМатериалы
	|ГДЕ
	|	ДокВводОстатковМатериалы.Ссылка = &ТекДок
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	Запрос.УстановитьПараметр( "ТекДок",   ДокументСсылка);
	РезультатТабЧасть = Запрос.Выполнить();
	
	// Вывод заголовка
		
	Область = Макет.ПолучитьОбласть("Заголовок");
	НомерДокумента = общ_ПереопределениеПроцедурБККлиентСервер.ПолучитьНомерНаПечать(ДокументСсылка.Номер, ДокументСсылка.Ссылка);
	Область.Параметры.ТекстЗаголовок = "Ввод начальных остатков материалов в эксплуатации № "+НомерДокумента +" от "+Шапка.Дата;
	
	СведенияОбОрганизации = общ_ПереопределяемыеПроцедурыБКВызовСервера.СведенияОЮрФизЛице(Шапка.Организация,Шапка.Дата);
	Область.Параметры.ПечОрганизация = СведенияОбОрганизации.ПолноеНаименование;	
	Область.Параметры.Подразделение    = Шапка.Подразделение;
	Область.Параметры.ПечПодразделение = Шапка.ПечПодразделение;
	
	ТабДокумент.Вывести(Область);
	
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	КолАртикул = ?( ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул, "Артикул",
				 ?( ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код,     "Код", ""));
	ФлагВыводКода = НЕ ПустаяСтрока(КолАртикул);
	Суффикс = ?(ФлагВыводКода, "СКодом", "");
	Область = Макет.ПолучитьОбласть("ТабШапка" + Суффикс);
	Если ФлагВыводКода Тогда
		Область.Параметры.ИмяАртикул = КолАртикул;
	КонецЕсли;
	
	ТабДокумент.Вывести(Область);
	
	Область  = Макет.ПолучитьОбласть("Строка" + Суффикс);
	ТабЧасть = РезультатТабЧасть.Выбрать();
	Пока ТабЧасть.Следующий() Цикл
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		Если ФлагВыводКода Тогда
			Область.Параметры.Артикул = ТабЧасть[КолАртикул];
		КонецЕсли;
		
		Область.Параметры.ПечНомер    = ТабЧасть.НомерСтроки;
		Область.Параметры.Материал    = ТабЧасть.Материал;
		Область.Параметры.ПечМатериал = ТабЧасть.ПечМатериал;
		Если си_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("си_УчетСпецодеждыПоХарактеристикам") И ЗначениеЗаполнено(ТабЧасть.Характеристика) Тогда
			Область.Параметры.ПечМатериал = Область.Параметры.ПечМатериал + ", " + ТабЧасть.Характеристика;
		КонецЕсли;
		
		
		Область.Параметры.Колво    = ТабЧасть.Количество;
		Область.Параметры.ПечЕдИзм = ТабЧасть.ПечЕдИзм;
		Область.Параметры.ЕдИзм    = ТабЧасть.ЕдИзм;
		
		Область.Параметры.Работник            = ТабЧасть.Работник;
		Область.Параметры.ПечРаботник         = ТабЧасть.ПечРаботник;
		Область.Параметры.ПечДокПередачи      = ТабЧасть.ПечДокПередачи;
		Область.Параметры.ДатаПередачи     	  = ТабЧасть.ДатаПередачи;
		
		
		ТабДокумент.Вывести(Область);
		
	КонецЦикла;
	Область = Макет.ПолучитьОбласть("ТабНиз");
	ТабДокумент.Вывести(Область);
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ВставлятьРазделительСтраниц = Истина;
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ДокументСсылка);
	КонецЦикла;
	Возврат ТабДокумент;
	
КонецФункции // ПечатьВводОстатков()

// Функция формирование печатной формы
//
Функция ПечатьВводНачальныхОстатков(МассивОбъектов, ОбъектыПечати) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.си_ВводНачальныхОстатковМатериаловВЭксплуатации.ПФ_MXL_ВводНачальныхОстатков");
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.КлючПараметровПечати = "ВводНачальныхОстатков";
	
	Для каждого ДокументСсылка	 Из МассивОбъектов Цикл
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокВводОстатков.Организация,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатков.Организация) КАК ПечОрганизация,
	|	ДокВводОстатков.СтруктурноеПодразделение КАК Подразделение,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатков.СтруктурноеПодразделение) КАК ПечПодразделение,
	|	ДокВводОстатков.Ссылка КАК Док,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатков.Ссылка) КАК ПечДок,
	|	ДокВводОстатков.Номер,
	|	ДокВводОстатков.Дата
	|ИЗ
	|	Документ.си_ВводНачальныхОстатковМатериаловВЭксплуатации КАК ДокВводОстатков
	|ГДЕ
	|	ДокВводОстатков.Ссылка = &ТекДок";
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр( "ТекДок",   ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Шапка = РезультатЗапроса.Выбрать();
	Шапка.Следующий();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокВводОстатковМатериалы.НомерСтроки КАК НомерСтроки,
	|	ДокВводОстатковМатериалы.ЕдиницаИзмерения КАК ЕдИзм,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатковМатериалы.ЕдиницаИзмерения) КАК ПечЕдИзм,
	|	ДокВводОстатковМатериалы.Номенклатура КАК Материал,
	|	ДокВводОстатковМатериалы.Номенклатура.Код КАК Код,
	|	ДокВводОстатковМатериалы.Номенклатура.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатковМатериалы.Номенклатура) КАК ПечМатериал,
	|	ДокВводОстатковМатериалы.Количество,
	|	ДокВводОстатковМатериалы.Сотрудник КАК Работник,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатковМатериалы.Сотрудник) КАК ПечРаботник,
	|	ДокВводОстатковМатериалы.ДокументПередачи КАК ПечДокПередачи,
	|	ДокВводОстатковМатериалы.ДатаПередачиВЭксплуатацию КАК ДатаПередачи,
	|	ДокВводОстатковМатериалы.Характеристика КАК Характеристика,
	|	ДокВводОстатковМатериалы.ОстаточнаяСтоимость,
	|	ДокВводОстатковМатериалы.ОстаточныйСрокСлужбы,
	|	ДокВводОстатковМатериалы.Состояние КАК Состояние,
	|	ДокВводОстатковМатериалы.Склад,
	|	ПРЕДСТАВЛЕНИЕ(ДокВводОстатковМатериалы.Склад) КАК ПечСклад
	|ИЗ
	|	Документ.си_ВводНачальныхОстатковМатериаловВЭксплуатации.Материалы КАК ДокВводОстатковМатериалы
	|ГДЕ
	|	ДокВводОстатковМатериалы.Ссылка = &ТекДок
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки
	|ИТОГИ ПО
	|	Состояние";
	Запрос.УстановитьПараметр( "ТекДок",   ДокументСсылка);
	РезультатТабЧасть = Запрос.Выполнить();
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	НомерДокумента = общ_ПереопределениеПроцедурБККлиентСервер.ПолучитьНомерНаПечать(ДокументСсылка.Номер, ДокументСсылка.Ссылка);
	Область.Параметры.ТекстЗаголовок = "Ввод начальных остатков материалов в эксплуатации № "+НомерДокумента +" от "+Шапка.Дата;
	
	СведенияОбОрганизации = общ_ПереопределяемыеПроцедурыБКВызовСервера.СведенияОЮрФизЛице(Шапка.Организация,Шапка.Дата);
	Область.Параметры.ПечОрганизация = СведенияОбОрганизации.ПолноеНаименование;	
	Область.Параметры.Подразделение    = Шапка.Подразделение;
	Область.Параметры.ПечПодразделение = Шапка.ПечПодразделение;
	
	ТабДокумент.Вывести(Область);
	
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	ПечатьХарактеристики = Константы.си_УчетСпецодеждыПоХарактеристикам.Получить();
	КолАртикул = ?( ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул, "Артикул",
				 ?( ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код,     "Код", ""));
	ФлагВыводКода = НЕ ПустаяСтрока(КолАртикул);
	Суффикс = ?(ФлагВыводКода, "СКодом", "");
	Суффикс = Суффикс + ?(ПечатьХарактеристики, "", "БезХ");
	Область = Макет.ПолучитьОбласть("ТабШапка" + Суффикс);
	Если ФлагВыводКода Тогда
		Область.Параметры.ИмяАртикул = КолАртикул;
	КонецЕсли;
	
	ТабДокумент.Вывести(Область);
	
	Область  = Макет.ПолучитьОбласть("Строка" + Суффикс);
	ТабЧастьСостояние = РезультатТабЧасть.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ТабЧастьСостояние.Следующий() Цикл
		ОбластьСостояние = Макет.ПолучитьОбласть("СтрокаСостояние" + Суффикс);
		ОбластьСостояние.Параметры.Заполнить(ТабЧастьСостояние);
		ТабДокумент.Вывести(ОбластьСостояние);
		
		ТабЧасть = ТабЧастьСостояние.Выбрать();
		Пока ТабЧасть.Следующий() Цикл
			НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
			Если ФлагВыводКода Тогда
				Область.Параметры.Артикул = ТабЧасть[КолАртикул];
			КонецЕсли;
			Область.Параметры.Заполнить(ТабЧасть);
			Область.Параметры.ПечНомер    = ТабЧасть.НомерСтроки;
			Область.Параметры.Материал    = ТабЧасть.Материал;
			Область.Параметры.ПечМатериал = ТабЧасть.ПечМатериал;
			Если си_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("си_УчетСпецодеждыПоХарактеристикам") И ЗначениеЗаполнено(ТабЧасть.Характеристика) Тогда
				Область.Параметры.ПечМатериал = Область.Параметры.ПечМатериал + ", " + ТабЧасть.Характеристика;
			КонецЕсли;
			
			Область.Параметры.Количество = ТабЧасть.Количество;
			Область.Параметры.ПечЕдИзм = ТабЧасть.ПечЕдИзм;
			Область.Параметры.ЕдИзм    = ТабЧасть.ЕдИзм;
			
			Область.Параметры.Работник            = ТабЧасть.Работник;
			Область.Параметры.ПечРаботник         = ТабЧасть.ПечРаботник;
			Если Не ЗначениеЗаполнено(ТабЧасть.Работник) Тогда 
				Область.Параметры.Работник            = ТабЧасть.Склад;
				Область.Параметры.ПечРаботник         = ТабЧасть.ПечСклад;
			КонецЕсли;
			
			Область.Параметры.ДатаПередачи     	  = Формат(ТабЧасть.ДатаПередачи,"ДФ=dd.MM.yyyy");
			
			ТабДокумент.Вывести(Область);
			
		КонецЦикла;
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("ТабНиз");
	ТабДокумент.Вывести(Область);
	ТабДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ВставлятьРазделительСтраниц = Истина;
	ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
	УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, НомерСтрокиНачало, ОбъектыПечати, ДокументСсылка);
	КонецЦикла;
	Возврат ТабДокумент;
	
КонецФункции // ПечатьВводОстатков()

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	// Ввод начальных остатков
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ВводНачальныхОстатков";
	КомандаПечати.Представление = НСтр("ru = 'Ввод начальных остатков материалов в эксплуатации'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = НЕ общ_ПереопределяемыеПроцедурыБКВызовСервераПовтИсп.РазрешитьПечатьНепроведенныхДокументов();
	КомандаПечати.Порядок = 50;

	Возврат;	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ВводНачальныхОстатков") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ВводНачальныхОстатков",
			НСтр("ru = 'Ввод начальных остатков материалов в эксплуатации'"),
			ПечатьВводНачальныхОстатков(МассивОбъектов, ОбъектыПечати),
			,
			"Документ.си_ВводНачальныхОстатковМатериаловВЭксплуатации.ПФ_MXL_ВводНачальныхОстатков");
	КонецЕсли;
		
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	ПереопределяемыеЗапросы = Новый Массив;
	ДополнительныеПараметрыЗапросов = Новый Структура();
	
	ПараметрыПроведения = си_УчетСпецодеждыУправлениеПроведениемДокументовСервер.ПодготовитьПараметрыПроведения(ДокументСсылка,Отказ,,,,,,ПереопределяемыеЗапросы,ДополнительныеПараметрыЗапросов);
	
	Возврат ПараметрыПроведения;

КонецФункции

#КонецОбласти


#КонецЕсли
